You're right, I've just tried [checked the implementation](https://github.com/terraform-providers/terraform-provider-aws/blob/master/aws/resource_aws_sns_topic.go#L116) and can confirm that it needs a number.

I have noticed that this happens only when creating a new `aws_sns_topic` resource. Modifying and existing one always results in a correct value on the console, both going from 0 -> 2 and 2 -> 0.
Quite strange because the plan output seems okay:
```log
+ resource "aws_sns_topic" "topic2" {
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + name                             = "github-test-topic-2"
      + policy                           = (known after apply)
      + sqs_failure_feedback_role_arn    = "arn:aws:iam::ACCOUNT_ID:role/sns_delivery_role"
      + sqs_success_feedback_role_arn    = "arn:aws:iam::ACCOUNT_ID:role/sns_delivery_role"
      + sqs_success_feedback_sample_rate = 0
    }
```